from private_data import repl

repl = {
    "LAB-ID": 6,
    "LAB-TITLE": "Работа со структурами данных на основе списков",
    "STUDENT-NAME": "",
    "GROUP-ID": "",
    "TEACHER-NAME": "",
    "LOCATION": "Москва",
    "YEAR": 2023,
    "PROBLEM": """Вариант №30<br><br>
Индивидуальное задание:<br><br>
Продублировать все гласные буквы в строке.<br>
""",
    "USED-DATA-TYPES": "При выполнении данной лабораторной работы использовался встроенный тип данных char, предназначенный для работы с символами и строками.",
    "GRAPH": """
<img width="400" alt="graph1" src="graphs_lab6/graph1.png">
<br><br><br>
    """,
    "PROGRAMS-TEMPLATE": """<p>Листинг {number}: Исходные коды программы {filename} (файл: {filepath})</p>
        <pre>
{code}
</pre>""",
    "PROGRAMS": "",
    "TEST-EXAMPLES": "",
    "TESTER-TEMPLATE": """<p>Исходный код тестирующей программы {filename} (файл: {filepath})</p>
        <pre>
{code}
</pre>""",
    "TESTER": "",
    "TIMING": """
<img width="600" alt="figure" src="graphs_lab6/figure.png"><br>
Как можно увидеть из приведённого выше графика, пузырьковая сортировка и двухсторонняя сортировка выбором ожидаемо работают за квадратичное время, т.к. их графики являются параболами<br>
И также можно увидеть, что быстрая сортировка работает за ожидаемое O(n * log n), она растёт почти линейно<br>
""",
    "CONCLUSIONS": """
В ходе выполнения данной работы была рассмотрена структура данных - список, а также методы работы с ним<br>
""",
    **repl
}
